import os

# M = Модуль порівняння (2^23 - 1)
# Це максимальне значення + 1, яке може згенерувати наш алгоритм
M = 8388607

# A = Множник (10^3)
# Число, на яке множиться попередній результат
A = 1000

# C = Приріст
# Число, яке додається до результату множення
C = 377

# X0 = Початкове значення ("зерно" або "seed")
# Це стартова точка для нашого генератора
X0 = 7

script_dir = os.path.dirname(os.path.abspath(__file__))
output_path = os.path.join(script_dir, "results.txt")



def linear_congruential_generator(Xn, a, c, m):
    """
    Ця функція реалізує один крок алгоритму лінійного порівняння.
    Вона приймає поточне число (Xn) та параметри (a, c, m)
    і повертає наступне число (Xn+1) за формулою:
    Xn+1 = (a * Xn + c) % m
    
    % — це оператор "взяття залишку від ділення" (mod m).
    """
    return (a * Xn + c) % m




try:
    # Запитуємо у користувача, скільки чисел потрібно згенерувати
    # int(...) намагається перетворити введені дані на ціле число
    N = int(input("Введіть кількість псевдовипадкових чисел для генерації: "))

   
    with open(output_path, "w", encoding="utf-8") as f:
        
        print(f"\n--- Генерація {N} псевдовипадкових чисел ---")
        
        # Записуємо заголовок у файл.
        f.write(f"--- Результати для m={M}, a={A}, c={C}, X0={X0} ---\n")
        
        # Ініціалізуємо генератор
        # 'current_X' буде зберігати останнє згенероване число
        # Починаємо з X0 (але не записуємо його)
        current_X = X0
        
        # 'for i in range(N):' — це цикл, який повториться N разів
        for i in range(N):
            # 1. Розраховуємо нове число на основі попереднього
            current_X = linear_congruential_generator(current_X, A, C, M)
            
           
            print(f"Число {i+1}: {current_X}")
            
            #Записуємо те саме число у файл
            
            f.write(f"{current_X}\n")
            
       
        print(f"\n--- Успішно згенеровано і збережено {N} чисел у файл '{output_path}' ---")

except ValueError:
    # Цей блок виконається, якщо int(input(...)) не спрацює
    print("Помилка: Ви ввели не число. Будь ласка, перезапустіть програму.")
except Exception as e:
    # Цей блок "спіймає" будь-яку іншу неочікувану помилку (наприклад, з дозволами)
    print(f"Сталася неочікувана помилка: {e}")